module.exports.config = {
  name: "goiadmin",
    version: "1.0.0",
    permission: 0,
    credits: "nayan",
    description: "mention",
    prefix: true,
    category: "user",
    usages: "tag",
    cooldowns: 5,
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "100075421394195") {
    var aid = ["100075421394195"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["মেনশন না দিয়ে সোজা বুকে আসেন, বসকে একটু আরামে রাখেন 😌💔",
        "এত মেনশন করেন কেন, উনি তো বলে দিলেন বিজি আছেন! 🥲😂",
        "মেনশন দিলে লাভ নাই, আসেন বুকে মিশে যাই—একটু রোমান্স করি 🥰💞",
        "এই যে এত মেনশন করছেন, দেখা হলে কিন্তু হাত ধরে ফেলব! সাবধান 🥵🤭",
        "ওনাকে এত মেনশন করলে লাভ কী? সরাসরি কিছু বলেন না কেন 😏💖",
        "মেনশন দিয়ে শুধু নাম ডাকার মানে কী, একটু মনেও রাখেন না তো! 🤷‍♂️💋",
        "ওনাকে মেনশন করলেই মনে হয় প্রপোজ করছে! শেষে দেখি শুধু মজা নিচ্ছে 🤦‍♂️😂",
        "মেনশন না দিয়ে একটু প্রেমের কথা শোনালে হয় না? উনি খুশি থাকবেন 🥺🌹",
        "মেনশন দিয়ে লাভ কি, একটু প্রেমের গন্ধ ছড়ান তো—ওনার মন ভিজে যাবে 😌🌹",
        "মেনশন বাদ দিয়ে একটু সাহস দেখান, সরাসরি বলুন! 🙃📖",
        "আলিফ বস কে মেনশন করে বারবার ডাকবেন না, উনি আসলেই বিজি এখন 🥵🥀🤐",
        "মেনশন করলেই কি হবে? কিছুটা সময় দেন বসের একা থাকার জন্য 🤗🍫",
        "মেনশন না করে সরাসরি ইনবক্সে এসে কথা বলেন, উনি অপেক্ষায় আছেন! 😏🍕",
        "মেনশন দিয়ে ডাকলেও লাভ নাই, কাছে আসেন না হয় একটু প্রেমের ধোঁয়া ছাড়ি 😜💖"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
}